Revit 2027 API
BuiltInFailures.PipingFailures.CannotCreateGeometryForPipe Property
 Cannot create geometry for flex pipe. The flex pipe is intersecting itself or the start and end are too close together.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateGeometryForPipe { get; }
Public Shared ReadOnly Property CannotCreateGeometryForPipe As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateGeometryForPipe {
	FailureDefinitionId^ get ();
}
static member CannotCreateGeometryForPipe : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace